tulparlabs/ardupilot/libraries/AP_HAL_ChibiOS/UARTDriver_STM32F4.cpp
/*
  DMA transmit complettion interrupt handler
 */
void UARTDriver_STM32F4::tx_complete(void* self, uint32_t flags)
{
    UARTDriver_STM32F4* uart_drv = (UARTDriver_STM32F4*)self;
    if (!uart_drv->tx_bounce_buf_ready) {
        uart_drv->_last_write_completed_us = AP_HAL::micros();
        uart_drv->tx_bounce_buf_ready = true;
        if (uart_drv->unbuffered_writes && uart_drv->_writebuf.available()) {
            // trigger a rapid send of next bytes
            chSysLockFromISR();
            chEvtSignalI(uart_thread_ctx, EVENT_MASK(uart_drv->serial_num));
            chSysUnlockFromISR();
        }
        uart_drv->dma_handle->unlock_from_IRQ();
    }
}


void UARTDriver_STM32F4::rx_irq_cb(void* self)
{
#if HAL_USE_SERIAL == TRUE
    UARTDriver_STM32F4* uart_drv = (UARTDriver_STM32F4*)self;
    if (!uart_drv->sdef.dma_rx) {
        return;
    }
#if defined(STM32F7)
    //disable dma, triggering DMA transfer complete interrupt
    uart_drv->rxdma->stream->CR &= ~STM32_DMA_CR_EN;
#else
    volatile uint16_t sr = ((SerialDriver*)(uart_drv->sdef.serial))->usart->SR;
    if(sr & USART_SR_IDLE) {
        volatile uint16_t dr = ((SerialDriver*)(uart_drv->sdef.serial))->usart->DR;
        (void)dr;
        //disable dma, triggering DMA transfer complete interrupt
        uart_drv->rxdma->stream->CR &= ~STM32_DMA_CR_EN;
    }
#endif // STM32F7
#endif // HAL_USE_SERIAL
}

void UARTDriver_STM32F4::rxbuff_full_irq(void* self, uint32_t flags)
{
#if HAL_USE_SERIAL == TRUE
    UARTDriver_STM32F4* uart_drv = (UARTDriver_STM32F4*)self;
    if (uart_drv->_lock_rx_in_timer_tick) {
        return;
    }
    if (!uart_drv->sdef.dma_rx) {
        return;
    }
    uint8_t len = RX_BOUNCE_BUFSIZE - uart_drv->rxdma->stream->NDTR;
    if (len == 0) {
        return;
    }
    uart_drv->_readbuf.write(uart_drv->rx_bounce_buf, len);
    //restart the DMA transfers
    dmaStreamSetMemory0(uart_drv->rxdma, uart_drv->rx_bounce_buf);
    dmaStreamSetTransactionSize(uart_drv->rxdma, RX_BOUNCE_BUFSIZE);
    dmaStreamEnable(uart_drv->rxdma);
    if (uart_drv->_wait.thread_ctx && uart_drv->_readbuf.available() >= uart_drv->_wait.n) {
        chSysLockFromISR();
        chEvtSignalI(uart_drv->_wait.thread_ctx, EVT_DATA);                    
        chSysUnlockFromISR();
    }
    if (uart_drv->_rts_is_active) {
        uart_drv->update_rts_line();
    }
#endif // HAL_USE_SERIAL
}

void UARTDriver_STM32F4::begin(uint32_t b)
{
    begin(b, 0, 0);
}

void UARTDriver_STM32F4::end()
{
    _initialised = false;
    while (_in_timer) hal.scheduler->delay(1);

    if (sdef.is_usb) {
#ifdef HAVE_USB_SERIAL

        sduStop((SerialUSBDriver*)sdef.serial);
#endif
    } else {
#if HAL_USE_SERIAL == TRUE
        sdStop((SerialDriver*)sdef.serial);
#endif
    }
    _readbuf.set_size(0);
    _writebuf.set_size(0);
}

void UARTDriver_STM32F4::flush()
{
    if (sdef.is_usb) {
#ifdef HAVE_USB_SERIAL

        sduSOFHookI((SerialUSBDriver*)sdef.serial);
#endif
    } else {
        //TODO: Handle this for other serial ports
    }
}

bool UARTDriver_STM32F4::is_initialized()
{
    return _initialised;
}

void UARTDriver_STM32F4::set_blocking_writes(bool blocking)
{
    _blocking_writes = blocking;
}

bool UARTDriver_STM32F4::tx_pending() { return false; }

/* Empty implementations of Stream virtual methods */
uint32_t UARTDriver_STM32F4::available() {
    if (!_initialised) {
        return 0;
    }
    if (sdef.is_usb) {
#ifdef HAVE_USB_SERIAL

        if (((SerialUSBDriver*)sdef.serial)->config->usbp->state != USB_ACTIVE) {
            return 0;
        }
#endif
    }
    return _readbuf.available();
}

uint32_t UARTDriver_STM32F4::txspace()
{
    if (!_initialised) {
        return 0;
    }
    return _writebuf.space();
}

int16_t UARTDriver_STM32F4::read()
{
    if (_uart_owner_thd != chThdGetSelfX()){
        return -1;
    }
    if (!_initialised) {
        return -1;
    }

    uint8_t byte;
    if (!_readbuf.read_byte(&byte)) {
        return -1;
    }
    if (!_rts_is_active) {
        update_rts_line();
    }
    
    return byte;
}

/* Empty implementations of Print virtual methods */
size_t UARTDriver_STM32F4::write(uint8_t c)
{
    if (lock_key != 0 || !_write_mutex.take_nonblocking()) {
        return 0;
    }
    
    if (!_initialised) {
        _write_mutex.give();
        return 0;
    }

    while (_writebuf.space() == 0) {
        if (!_blocking_writes) {
            _write_mutex.give();
            return 0;
        }
        hal.scheduler->delay(1);
    }
    size_t ret = _writebuf.write(&c, 1);
    if (unbuffered_writes) {
        write_pending_bytes();
    }
    _write_mutex.give();
    return ret;
}

size_t UARTDriver_STM32F4::write(const uint8_t *buffer, size_t size)
{
    if (!_initialised || lock_key != 0) {
		return 0;
	}

    if (!_write_mutex.take_nonblocking()) {
        return 0;
    }

    if (_blocking_writes && !unbuffered_writes) {
        /*
          use the per-byte delay loop in write() above for blocking writes
         */
        _write_mutex.give();
        size_t ret = 0;
        while (size--) {
            if (write(*buffer++) != 1) break;
            ret++;
        }
        return ret;
    }

    size_t ret = _writebuf.write(buffer, size);
    if (unbuffered_writes) {
        write_pending_bytes();
    }
    _write_mutex.give();
    return ret;
}

/*
  lock the uart for exclusive use by write_locked() with the right key
 */
bool UARTDriver::lock_port(uint32_t key)
{
    if (lock_key && key != lock_key && key != 0) {
        // someone else is using it
        return false;
    }
    lock_key = key;
    return true;
}

/* 
   write to a locked port. If port is locked and key is not correct then 0 is returned
   and write is discarded. All writes are non-blocking
*/
size_t UARTDriver::write_locked(const uint8_t *buffer, size_t size, uint32_t key)
{
    if (lock_key != 0 && key != lock_key) {
        return 0;
    }
    if (!_write_mutex.take_nonblocking()) {
        return 0;
    }
    size_t ret = _writebuf.write(buffer, size);

    _write_mutex.give();

    return ret;
}

